package day22;

/*
Дан массив int. Верните true, если цифра 6 является значением в первом или последнем элементе массива.
        Массив будет длиной больше, либо равной единице.
*/
public class File18Task01 {
    public static void main(String[] args) {
        /*int[] arr1 = new int[]{1, 2, 6};
        int[] arr2 = new int[]{6, 1, 2, 3};
        int[] arr3 = new int[]{13, 6, 1, 2, 3};
        System.out.println(firstLast6(arr1));// →true
        System.out.println(firstLast6(arr2));// →true
        System.out.println(firstLast6(arr3));// →false
    }

    private static boolean[] firstLast6(int[] input) {
if (input[0] == 6 )

        return false;*/
    }
}
